name: "resnet_motion"

input: "data"
input_shape {
  dim: 1
  dim: 3
  dim: 227
  dim: 227
}

layer {
name: "conv1_motion"
type: "Convolution"
bottom: "data"
top: "conv1_motion"
param {
  name: "conv1_0_motion"
  lr_mult: 1.0
  decay_mult: 1.0
}
convolution_param {
  num_output: 64
  bias_term: false
  pad: 3
  kernel_size: 7
  stride: 2
}
}

layer {
name: "bn_conv1_motion"
type: "BatchNorm"
bottom: "conv1_motion"
top: "conv1_motion"
param {
  name: "bn_conv1_0_motion"
  lr_mult: 0.0
}
param {
  name: "bn_conv1_1_motion"
  lr_mult: 0.0
}
param {
  name: "bn_conv1_2_motion"
  lr_mult: 0.0
}
batch_norm_param {
  use_global_stats: true
}
}

layer {
name: "scale_conv1_motion"
type: "Scale"
bottom: "conv1_motion"
top: "conv1_motion"
param {
  name: "scale_conv1_0_motion"
  lr_mult: 0.0
}
param {
  name: "scale_conv1_1_motion"
  lr_mult: 0.0
}
scale_param {
  bias_term: true
}
}

layer {
name: "conv1_relu_motion"
type: "ReLU"
bottom: "conv1_motion"
top: "conv1_motion"
}

layer {
name: "pool1_motion"
type: "Pooling"
bottom: "conv1_motion"
top: "pool1_motion"
pooling_param {
  pool: MAX
  kernel_size: 3
  stride: 2
  pad: 1
}
}

layer {
name: "res2a_branch1_motion"
type: "Convolution"
bottom: "pool1_motion"
top: "res2a_branch1_motion"
param {
  name: "res2a_branch1_0_motion"
  lr_mult: 1.0
  decay_mult: 1.0
}
convolution_param {
  num_output: 256
  bias_term: false
  pad: 0
  kernel_size: 1
  stride: 1
}
}

layer {
name: "bn2a_branch1_motion"
type: "BatchNorm"
bottom: "res2a_branch1_motion"
top: "res2a_branch1_motion"
param {
  name: "bn2a_branch1_0_motion"
  lr_mult: 0.0
}
param {
  name: "bn2a_branch1_1_motion"
  lr_mult: 0.0
}
param {
  name: "bn2a_branch1_2_motion"
  lr_mult: 0.0
}
batch_norm_param {
  use_global_stats: true
}
}

layer {
name: "scale2a_branch1_motion"
type: "Scale"
bottom: "res2a_branch1_motion"
top: "res2a_branch1_motion"
param {
  name: "scale2a_branch1_0_motion"
  lr_mult: 0.0
}
param {
  name: "scale2a_branch1_1_motion"
  lr_mult: 0.0
}
scale_param {
  bias_term: true
}
}

layer {
name: "res2a_branch2a_motion"
type: "Convolution"
bottom: "pool1_motion"
top: "res2a_branch2a_motion"
param {
  name: "res2a_branch2a_0_motion"
  lr_mult: 1.0
  decay_mult: 1.0
}
convolution_param {
  num_output: 64
  bias_term: false
  pad: 0
  kernel_size: 1
  stride: 1
}
}

layer {
name: "bn2a_branch2a_motion"
type: "BatchNorm"
bottom: "res2a_branch2a_motion"
top: "res2a_branch2a_motion"
param {
  name: "bn2a_branch2a_0_motion"
  lr_mult: 0.0
}
param {
  name: "bn2a_branch2a_1_motion"
  lr_mult: 0.0
}
param {
  name: "bn2a_branch2a_2_motion"
  lr_mult: 0.0
}
batch_norm_param {
  use_global_stats: true
}
}

layer {
name: "scale2a_branch2a_motion"
type: "Scale"
bottom: "res2a_branch2a_motion"
top: "res2a_branch2a_motion"
param {
  name: "scale2a_branch2a_0_motion"
  lr_mult: 0.0
}
param {
  name: "scale2a_branch2a_1_motion"
  lr_mult: 0.0
}
scale_param {
  bias_term: true
}
}

layer {
name: "res2a_branch2a_relu_motion"
type: "ReLU"
bottom: "res2a_branch2a_motion"
top: "res2a_branch2a_motion"
}

layer {
name: "res2a_branch2b_motion"
type: "Convolution"
bottom: "res2a_branch2a_motion"
top: "res2a_branch2b_motion"
param {
  name: "res2a_branch2b_0_motion"
  lr_mult: 1.0
  decay_mult: 1.0
}
convolution_param {
  num_output: 64
  bias_term: false
  pad: 1
  kernel_size: 3
  stride: 1
}
}

layer {
name: "bn2a_branch2b_motion"
type: "BatchNorm"
bottom: "res2a_branch2b_motion"
top: "res2a_branch2b_motion"
param {
  name: "bn2a_branch2b_0_motion"
  lr_mult: 0.0
}
param {
  name: "bn2a_branch2b_1_motion"
  lr_mult: 0.0
}
param {
  name: "bn2a_branch2b_2_motion"
  lr_mult: 0.0
}
batch_norm_param {
  use_global_stats: true
}
}

layer {
name: "scale2a_branch2b_motion"
type: "Scale"
bottom: "res2a_branch2b_motion"
top: "res2a_branch2b_motion"
param {
  name: "scale2a_branch2b_0_motion"
  lr_mult: 0.0
}
param {
  name: "scale2a_branch2b_1_motion"
  lr_mult: 0.0
}
scale_param {
  bias_term: true
}
}

layer {
name: "res2a_branch2b_relu_motion"
type: "ReLU"
bottom: "res2a_branch2b_motion"
top: "res2a_branch2b_motion"
}

layer {
name: "res2a_branch2c_motion"
type: "Convolution"
bottom: "res2a_branch2b_motion"
top: "res2a_branch2c_motion"
param {
  name: "res2a_branch2c_0_motion"
  lr_mult: 1.0
  decay_mult: 1.0
}
convolution_param {
  num_output: 256
  bias_term: false
  pad: 0
  kernel_size: 1
  stride: 1
}
}

layer {
name: "bn2a_branch2c_motion"
type: "BatchNorm"
bottom: "res2a_branch2c_motion"
top: "res2a_branch2c_motion"
param {
  name: "bn2a_branch2c_0_motion"
  lr_mult: 0.0
}
param {
  name: "bn2a_branch2c_1_motion"
  lr_mult: 0.0
}
param {
  name: "bn2a_branch2c_2_motion"
  lr_mult: 0.0
}
batch_norm_param {
  use_global_stats: true
}
}

layer {
name: "scale2a_branch2c_motion"
type: "Scale"
bottom: "res2a_branch2c_motion"
top: "res2a_branch2c_motion"
param {
  name: "scale2a_branch2c_0_motion"
  lr_mult: 0.0
}
param {
  name: "scale2a_branch2c_1_motion"
  lr_mult: 0.0
}
scale_param {
  bias_term: true
}
}

layer {
name: "res2a_motion"
type: "Eltwise"
bottom: "res2a_branch1_motion"
bottom: "res2a_branch2c_motion"
top: "res2a_motion"
}

layer {
name: "res2a_relu_motion"
type: "ReLU"
bottom: "res2a_motion"
top: "res2a_motion"
}

layer {
name: "res2b_branch2a_motion"
type: "Convolution"
bottom: "res2a_motion"
top: "res2b_branch2a_motion"
param {
  name: "res2b_branch2a_0_motion"
  lr_mult: 1.0
  decay_mult: 1.0
}
convolution_param {
  num_output: 64
  bias_term: false
  pad: 0
  kernel_size: 1
  stride: 1
}
}

layer {
name: "bn2b_branch2a_motion"
type: "BatchNorm"
bottom: "res2b_branch2a_motion"
top: "res2b_branch2a_motion"
param {
  name: "bn2b_branch2a_0_motion"
  lr_mult: 0.0
}
param {
  name: "bn2b_branch2a_1_motion"
  lr_mult: 0.0
}
param {
  name: "bn2b_branch2a_2_motion"
  lr_mult: 0.0
}
batch_norm_param {
  use_global_stats: true
}
}

layer {
name: "scale2b_branch2a_motion"
type: "Scale"
bottom: "res2b_branch2a_motion"
top: "res2b_branch2a_motion"
param {
  name: "scale2b_branch2a_0_motion"
  lr_mult: 0.0
}
param {
  name: "scale2b_branch2a_1_motion"
  lr_mult: 0.0
}
scale_param {
  bias_term: true
}
}

layer {
name: "res2b_branch2a_relu_motion"
type: "ReLU"
bottom: "res2b_branch2a_motion"
top: "res2b_branch2a_motion"
}

layer {
name: "res2b_branch2b_motion"
type: "Convolution"
bottom: "res2b_branch2a_motion"
top: "res2b_branch2b_motion"
param {
  name: "res2b_branch2b_0_motion"
  lr_mult: 1.0
  decay_mult: 1.0
}
convolution_param {
  num_output: 64
  bias_term: false
  pad: 1
  kernel_size: 3
  stride: 1
}
}

layer {
name: "bn2b_branch2b_motion"
type: "BatchNorm"
bottom: "res2b_branch2b_motion"
top: "res2b_branch2b_motion"
param {
  name: "bn2b_branch2b_0_motion"
  lr_mult: 0.0
}
param {
  name: "bn2b_branch2b_1_motion"
  lr_mult: 0.0
}
param {
  name: "bn2b_branch2b_2_motion"
  lr_mult: 0.0
}
batch_norm_param {
  use_global_stats: true
}
}

layer {
name: "scale2b_branch2b_motion"
type: "Scale"
bottom: "res2b_branch2b_motion"
top: "res2b_branch2b_motion"
param {
  name: "scale2b_branch2b_0_motion"
  lr_mult: 0.0
}
param {
  name: "scale2b_branch2b_1_motion"
  lr_mult: 0.0
}
scale_param {
  bias_term: true
}
}

layer {
name: "res2b_branch2b_relu_motion"
type: "ReLU"
bottom: "res2b_branch2b_motion"
top: "res2b_branch2b_motion"
}

layer {
name: "res2b_branch2c_motion"
type: "Convolution"
bottom: "res2b_branch2b_motion"
top: "res2b_branch2c_motion"
param {
  name: "res2b_branch2c_0_motion"
  lr_mult: 1.0
  decay_mult: 1.0
}
convolution_param {
  num_output: 256
  bias_term: false
  pad: 0
  kernel_size: 1
  stride: 1
}
}

layer {
name: "bn2b_branch2c_motion"
type: "BatchNorm"
bottom: "res2b_branch2c_motion"
top: "res2b_branch2c_motion"
param {
  name: "bn2b_branch2c_0_motion"
  lr_mult: 0.0
}
param {
  name: "bn2b_branch2c_1_motion"
  lr_mult: 0.0
}
param {
  name: "bn2b_branch2c_2_motion"
  lr_mult: 0.0
}
batch_norm_param {
  use_global_stats: true
}
}

layer {
name: "scale2b_branch2c_motion"
type: "Scale"
bottom: "res2b_branch2c_motion"
top: "res2b_branch2c_motion"
param {
  name: "scale2b_branch2c_0_motion"
  lr_mult: 0.0
}
param {
  name: "scale2b_branch2c_1_motion"
  lr_mult: 0.0
}
scale_param {
  bias_term: true
}
}

layer {
name: "res2b_motion"
type: "Eltwise"
bottom: "res2a_motion"
bottom: "res2b_branch2c_motion"
top: "res2b_motion"
}

layer {
name: "res2b_relu_motion"
type: "ReLU"
bottom: "res2b_motion"
top: "res2b_motion"
}

layer {
name: "res2c_branch2a_motion"
type: "Convolution"
bottom: "res2b_motion"
top: "res2c_branch2a_motion"
param {
  name: "res2c_branch2a_0_motion"
  lr_mult: 1.0
  decay_mult: 1.0
}
convolution_param {
  num_output: 64
  bias_term: false
  pad: 0
  kernel_size: 1
  stride: 1
}
}

layer {
name: "bn2c_branch2a_motion"
type: "BatchNorm"
bottom: "res2c_branch2a_motion"
top: "res2c_branch2a_motion"
param {
  name: "bn2c_branch2a_0_motion"
  lr_mult: 0.0
}
param {
  name: "bn2c_branch2a_1_motion"
  lr_mult: 0.0
}
param {
  name: "bn2c_branch2a_2_motion"
  lr_mult: 0.0
}
batch_norm_param {
  use_global_stats: true
}
}

layer {
name: "scale2c_branch2a_motion"
type: "Scale"
bottom: "res2c_branch2a_motion"
top: "res2c_branch2a_motion"
param {
  name: "scale2c_branch2a_0_motion"
  lr_mult: 0.0
}
param {
  name: "scale2c_branch2a_1_motion"
  lr_mult: 0.0
}
scale_param {
  bias_term: true
}
}

layer {
name: "res2c_branch2a_relu_motion"
type: "ReLU"
bottom: "res2c_branch2a_motion"
top: "res2c_branch2a_motion"
}

layer {
name: "res2c_branch2b_motion"
type: "Convolution"
bottom: "res2c_branch2a_motion"
top: "res2c_branch2b_motion"
param {
  name: "res2c_branch2b_0_motion"
  lr_mult: 1.0
  decay_mult: 1.0
}
convolution_param {
  num_output: 64
  bias_term: false
  pad: 1
  kernel_size: 3
  stride: 1
}
}

layer {
name: "bn2c_branch2b_motion"
type: "BatchNorm"
bottom: "res2c_branch2b_motion"
top: "res2c_branch2b_motion"
param {
  name: "bn2c_branch2b_0_motion"
  lr_mult: 0.0
}
param {
  name: "bn2c_branch2b_1_motion"
  lr_mult: 0.0
}
param {
  name: "bn2c_branch2b_2_motion"
  lr_mult: 0.0
}
batch_norm_param {
  use_global_stats: true
}
}

layer {
name: "scale2c_branch2b_motion"
type: "Scale"
bottom: "res2c_branch2b_motion"
top: "res2c_branch2b_motion"
param {
  name: "scale2c_branch2b_0_motion"
  lr_mult: 0.0
}
param {
  name: "scale2c_branch2b_1_motion"
  lr_mult: 0.0
}
scale_param {
  bias_term: true
}
}

layer {
name: "res2c_branch2b_relu_motion"
type: "ReLU"
bottom: "res2c_branch2b_motion"
top: "res2c_branch2b_motion"
}

layer {
name: "res2c_branch2c_motion"
type: "Convolution"
bottom: "res2c_branch2b_motion"
top: "res2c_branch2c_motion"
param {
  name: "res2c_branch2c_0_motion"
  lr_mult: 1.0
  decay_mult: 1.0
}
convolution_param {
  num_output: 256
  bias_term: false
  pad: 0
  kernel_size: 1
  stride: 1
}
}

layer {
name: "bn2c_branch2c_motion"
type: "BatchNorm"
bottom: "res2c_branch2c_motion"
top: "res2c_branch2c_motion"
param {
  name: "bn2c_branch2c_0_motion"
  lr_mult: 0.0
}
param {
  name: "bn2c_branch2c_1_motion"
  lr_mult: 0.0
}
param {
  name: "bn2c_branch2c_2_motion"
  lr_mult: 0.0
}
batch_norm_param {
  use_global_stats: true
}
}

layer {
name: "scale2c_branch2c_motion"
type: "Scale"
bottom: "res2c_branch2c_motion"
top: "res2c_branch2c_motion"
param {
  name: "scale2c_branch2c_0_motion"
  lr_mult: 0.0
}
param {
  name: "scale2c_branch2c_1_motion"
  lr_mult: 0.0
}
scale_param {
  bias_term: true
}
}

layer {
name: "res2c_motion"
type: "Eltwise"
bottom: "res2b_motion"
bottom: "res2c_branch2c_motion"
top: "res2c_motion"
}

layer {
name: "res2c_relu_motion"
type: "ReLU"
bottom: "res2c_motion"
top: "res2c_motion"
}

layer {
name: "res3a_branch1_motion"
type: "Convolution"
bottom: "res2c_motion"
top: "res3a_branch1_motion"
param {
  name: "res3a_branch1_0_motion"
  lr_mult: 1.0
  decay_mult: 1.0
}
convolution_param {
  num_output: 512
  bias_term: false
  pad: 0
  kernel_size: 1
  stride: 2
}
}

layer {
name: "bn3a_branch1_motion"
type: "BatchNorm"
bottom: "res3a_branch1_motion"
top: "res3a_branch1_motion"
param {
  name: "bn3a_branch1_0_motion"
  lr_mult: 0.0
}
param {
  name: "bn3a_branch1_1_motion"
  lr_mult: 0.0
}
param {
  name: "bn3a_branch1_2_motion"
  lr_mult: 0.0
}
batch_norm_param {
  use_global_stats: true
}
}

layer {
name: "scale3a_branch1_motion"
type: "Scale"
bottom: "res3a_branch1_motion"
top: "res3a_branch1_motion"
param {
  name: "scale3a_branch1_0_motion"
  lr_mult: 0.0
}
param {
  name: "scale3a_branch1_1_motion"
  lr_mult: 0.0
}
scale_param {
  bias_term: true
}
}

layer {
name: "res3a_branch2a_motion"
type: "Convolution"
bottom: "res2c_motion"
top: "res3a_branch2a_motion"
param {
  name: "res3a_branch2a_0_motion"
  lr_mult: 1.0
  decay_mult: 1.0
}
convolution_param {
  num_output: 128
  bias_term: false
  pad: 0
  kernel_size: 1
  stride: 2
}
}

layer {
name: "bn3a_branch2a_motion"
type: "BatchNorm"
bottom: "res3a_branch2a_motion"
top: "res3a_branch2a_motion"
param {
  name: "bn3a_branch2a_0_motion"
  lr_mult: 0.0
}
param {
  name: "bn3a_branch2a_1_motion"
  lr_mult: 0.0
}
param {
  name: "bn3a_branch2a_2_motion"
  lr_mult: 0.0
}
batch_norm_param {
  use_global_stats: true
}
}

layer {
name: "scale3a_branch2a_motion"
type: "Scale"
bottom: "res3a_branch2a_motion"
top: "res3a_branch2a_motion"
param {
  name: "scale3a_branch2a_0_motion"
  lr_mult: 0.0
}
param {
  name: "scale3a_branch2a_1_motion"
  lr_mult: 0.0
}
scale_param {
  bias_term: true
}
}

layer {
name: "res3a_branch2a_relu_motion"
type: "ReLU"
bottom: "res3a_branch2a_motion"
top: "res3a_branch2a_motion"
}

layer {
name: "res3a_branch2b_motion"
type: "Convolution"
bottom: "res3a_branch2a_motion"
top: "res3a_branch2b_motion"
param {
  name: "res3a_branch2b_0_motion"
  lr_mult: 1.0
  decay_mult: 1.0
}
convolution_param {
  num_output: 128
  bias_term: false
  pad: 1
  kernel_size: 3
  stride: 1
}
}

layer {
name: "bn3a_branch2b_motion"
type: "BatchNorm"
bottom: "res3a_branch2b_motion"
top: "res3a_branch2b_motion"
param {
  name: "bn3a_branch2b_0_motion"
  lr_mult: 0.0
}
param {
  name: "bn3a_branch2b_1_motion"
  lr_mult: 0.0
}
param {
  name: "bn3a_branch2b_2_motion"
  lr_mult: 0.0
}
batch_norm_param {
  use_global_stats: true
}
}

layer {
name: "scale3a_branch2b_motion"
type: "Scale"
bottom: "res3a_branch2b_motion"
top: "res3a_branch2b_motion"
param {
  name: "scale3a_branch2b_0_motion"
  lr_mult: 0.0
}
param {
  name: "scale3a_branch2b_1_motion"
  lr_mult: 0.0
}
scale_param {
  bias_term: true
}
}

layer {
name: "res3a_branch2b_relu_motion"
type: "ReLU"
bottom: "res3a_branch2b_motion"
top: "res3a_branch2b_motion"
}

layer {
name: "res3a_branch2c_motion"
type: "Convolution"
bottom: "res3a_branch2b_motion"
top: "res3a_branch2c_motion"
param {
  name: "res3a_branch2c_0_motion"
  lr_mult: 1.0
  decay_mult: 1.0
}
convolution_param {
  num_output: 512
  bias_term: false
  pad: 0
  kernel_size: 1
  stride: 1
}
}

layer {
name: "bn3a_branch2c_motion"
type: "BatchNorm"
bottom: "res3a_branch2c_motion"
top: "res3a_branch2c_motion"
param {
  name: "bn3a_branch2c_0_motion"
  lr_mult: 0.0
}
param {
  name: "bn3a_branch2c_1_motion"
  lr_mult: 0.0
}
param {
  name: "bn3a_branch2c_2_motion"
  lr_mult: 0.0
}
batch_norm_param {
  use_global_stats: true
}
}

layer {
name: "scale3a_branch2c_motion"
type: "Scale"
bottom: "res3a_branch2c_motion"
top: "res3a_branch2c_motion"
param {
  name: "scale3a_branch2c_0_motion"
  lr_mult: 0.0
}
param {
  name: "scale3a_branch2c_1_motion"
  lr_mult: 0.0
}
scale_param {
  bias_term: true
}
}

layer {
name: "res3a_motion"
type: "Eltwise"
bottom: "res3a_branch1_motion"
bottom: "res3a_branch2c_motion"
top: "res3a_motion"
}

layer {
name: "res3a_relu_motion"
type: "ReLU"
bottom: "res3a_motion"
top: "res3a_motion"
}

layer {
name: "res3b1_branch2a_motion"
type: "Convolution"
bottom: "res3a_motion"
top: "res3b1_branch2a_motion"
param {
  name: "res3b1_branch2a_0_motion"
  lr_mult: 1.0
  decay_mult: 1.0
}
convolution_param {
  num_output: 128
  bias_term: false
  pad: 0
  kernel_size: 1
  stride: 1
}
}

layer {
name: "bn3b1_branch2a_motion"
type: "BatchNorm"
bottom: "res3b1_branch2a_motion"
top: "res3b1_branch2a_motion"
param {
  name: "bn3b1_branch2a_0_motion"
  lr_mult: 0.0
}
param {
  name: "bn3b1_branch2a_1_motion"
  lr_mult: 0.0
}
param {
  name: "bn3b1_branch2a_2_motion"
  lr_mult: 0.0
}
batch_norm_param {
  use_global_stats: true
}
}

layer {
name: "scale3b1_branch2a_motion"
type: "Scale"
bottom: "res3b1_branch2a_motion"
top: "res3b1_branch2a_motion"
param {
  name: "scale3b1_branch2a_0_motion"
  lr_mult: 0.0
}
param {
  name: "scale3b1_branch2a_1_motion"
  lr_mult: 0.0
}
scale_param {
  bias_term: true
}
}

layer {
name: "res3b1_branch2a_relu_motion"
type: "ReLU"
bottom: "res3b1_branch2a_motion"
top: "res3b1_branch2a_motion"
}

layer {
name: "res3b1_branch2b_motion"
type: "Convolution"
bottom: "res3b1_branch2a_motion"
top: "res3b1_branch2b_motion"
param {
  name: "res3b1_branch2b_0_motion"
  lr_mult: 1.0
  decay_mult: 1.0
}
convolution_param {
  num_output: 128
  bias_term: false
  pad: 1
  kernel_size: 3
  stride: 1
}
}

layer {
name: "bn3b1_branch2b_motion"
type: "BatchNorm"
bottom: "res3b1_branch2b_motion"
top: "res3b1_branch2b_motion"
param {
  name: "bn3b1_branch2b_0_motion"
  lr_mult: 0.0
}
param {
  name: "bn3b1_branch2b_1_motion"
  lr_mult: 0.0
}
param {
  name: "bn3b1_branch2b_2_motion"
  lr_mult: 0.0
}
batch_norm_param {
  use_global_stats: true
}
}

layer {
name: "scale3b1_branch2b_motion"
type: "Scale"
bottom: "res3b1_branch2b_motion"
top: "res3b1_branch2b_motion"
param {
  name: "scale3b1_branch2b_0_motion"
  lr_mult: 0.0
}
param {
  name: "scale3b1_branch2b_1_motion"
  lr_mult: 0.0
}
scale_param {
  bias_term: true
}
}

layer {
name: "res3b1_branch2b_relu_motion"
type: "ReLU"
bottom: "res3b1_branch2b_motion"
top: "res3b1_branch2b_motion"
}

layer {
name: "res3b1_branch2c_motion"
type: "Convolution"
bottom: "res3b1_branch2b_motion"
top: "res3b1_branch2c_motion"
param {
  name: "res3b1_branch2c_0_motion"
  lr_mult: 1.0
  decay_mult: 1.0
}
convolution_param {
  num_output: 512
  bias_term: false
  pad: 0
  kernel_size: 1
  stride: 1
}
}

layer {
name: "bn3b1_branch2c_motion"
type: "BatchNorm"
bottom: "res3b1_branch2c_motion"
top: "res3b1_branch2c_motion"
param {
  name: "bn3b1_branch2c_0_motion"
  lr_mult: 0.0
}
param {
  name: "bn3b1_branch2c_1_motion"
  lr_mult: 0.0
}
param {
  name: "bn3b1_branch2c_2_motion"
  lr_mult: 0.0
}
batch_norm_param {
  use_global_stats: true
}
}

layer {
name: "scale3b1_branch2c_motion"
type: "Scale"
bottom: "res3b1_branch2c_motion"
top: "res3b1_branch2c_motion"
param {
  name: "scale3b1_branch2c_0_motion"
  lr_mult: 0.0
}
param {
  name: "scale3b1_branch2c_1_motion"
  lr_mult: 0.0
}
scale_param {
  bias_term: true
}
}

layer {
name: "res3b1_motion"
type: "Eltwise"
bottom: "res3a_motion"
bottom: "res3b1_branch2c_motion"
top: "res3b1_motion"
}

layer {
name: "res3b1_relu_motion"
type: "ReLU"
bottom: "res3b1_motion"
top: "res3b1_motion"
}

layer {
name: "res3b2_branch2a_motion"
type: "Convolution"
bottom: "res3b1_motion"
top: "res3b2_branch2a_motion"
param {
  name: "res3b2_branch2a_0_motion"
  lr_mult: 1.0
  decay_mult: 1.0
}
convolution_param {
  num_output: 128
  bias_term: false
  pad: 0
  kernel_size: 1
  stride: 1
}
}

layer {
name: "bn3b2_branch2a_motion"
type: "BatchNorm"
bottom: "res3b2_branch2a_motion"
top: "res3b2_branch2a_motion"
param {
  name: "bn3b2_branch2a_0_motion"
  lr_mult: 0.0
}
param {
  name: "bn3b2_branch2a_1_motion"
  lr_mult: 0.0
}
param {
  name: "bn3b2_branch2a_2_motion"
  lr_mult: 0.0
}
batch_norm_param {
  use_global_stats: true
}
}

layer {
name: "scale3b2_branch2a_motion"
type: "Scale"
bottom: "res3b2_branch2a_motion"
top: "res3b2_branch2a_motion"
param {
  name: "scale3b2_branch2a_0_motion"
  lr_mult: 0.0
}
param {
  name: "scale3b2_branch2a_1_motion"
  lr_mult: 0.0
}
scale_param {
  bias_term: true
}
}

layer {
name: "res3b2_branch2a_relu_motion"
type: "ReLU"
bottom: "res3b2_branch2a_motion"
top: "res3b2_branch2a_motion"
}

layer {
name: "res3b2_branch2b_motion"
type: "Convolution"
bottom: "res3b2_branch2a_motion"
top: "res3b2_branch2b_motion"
param {
  name: "res3b2_branch2b_0_motion"
  lr_mult: 1.0
  decay_mult: 1.0
}
convolution_param {
  num_output: 128
  bias_term: false
  pad: 1
  kernel_size: 3
  stride: 1
}
}

layer {
name: "bn3b2_branch2b_motion"
type: "BatchNorm"
bottom: "res3b2_branch2b_motion"
top: "res3b2_branch2b_motion"
param {
  name: "bn3b2_branch2b_0_motion"
  lr_mult: 0.0
}
param {
  name: "bn3b2_branch2b_1_motion"
  lr_mult: 0.0
}
param {
  name: "bn3b2_branch2b_2_motion"
  lr_mult: 0.0
}
batch_norm_param {
  use_global_stats: true
}
}

layer {
name: "scale3b2_branch2b_motion"
type: "Scale"
bottom: "res3b2_branch2b_motion"
top: "res3b2_branch2b_motion"
param {
  name: "scale3b2_branch2b_0_motion"
  lr_mult: 0.0
}
param {
  name: "scale3b2_branch2b_1_motion"
  lr_mult: 0.0
}
scale_param {
  bias_term: true
}
}

layer {
name: "res3b2_branch2b_relu_motion"
type: "ReLU"
bottom: "res3b2_branch2b_motion"
top: "res3b2_branch2b_motion"
}

layer {
name: "res3b2_branch2c_motion"
type: "Convolution"
bottom: "res3b2_branch2b_motion"
top: "res3b2_branch2c_motion"
param {
  name: "res3b2_branch2c_0_motion"
  lr_mult: 1.0
  decay_mult: 1.0
}
convolution_param {
  num_output: 512
  bias_term: false
  pad: 0
  kernel_size: 1
  stride: 1
}
}

layer {
name: "bn3b2_branch2c_motion"
type: "BatchNorm"
bottom: "res3b2_branch2c_motion"
top: "res3b2_branch2c_motion"
param {
  name: "bn3b2_branch2c_0_motion"
  lr_mult: 0.0
}
param {
  name: "bn3b2_branch2c_1_motion"
  lr_mult: 0.0
}
param {
  name: "bn3b2_branch2c_2_motion"
  lr_mult: 0.0
}
batch_norm_param {
  use_global_stats: true
}
}

layer {
name: "scale3b2_branch2c_motion"
type: "Scale"
bottom: "res3b2_branch2c_motion"
top: "res3b2_branch2c_motion"
param {
  name: "scale3b2_branch2c_0_motion"
  lr_mult: 0.0
}
param {
  name: "scale3b2_branch2c_1_motion"
  lr_mult: 0.0
}
scale_param {
  bias_term: true
}
}

layer {
name: "res3b2_motion"
type: "Eltwise"
bottom: "res3b1_motion"
bottom: "res3b2_branch2c_motion"
top: "res3b2_motion"
}

layer {
name: "res3b2_relu_motion"
type: "ReLU"
bottom: "res3b2_motion"
top: "res3b2_motion"
}

layer {
name: "res3b3_branch2a_motion"
type: "Convolution"
bottom: "res3b2_motion"
top: "res3b3_branch2a_motion"
param {
  name: "res3b3_branch2a_0_motion"
  lr_mult: 1.0
  decay_mult: 1.0
}
convolution_param {
  num_output: 128
  bias_term: false
  pad: 0
  kernel_size: 1
  stride: 1
}
}

layer {
name: "bn3b3_branch2a_motion"
type: "BatchNorm"
bottom: "res3b3_branch2a_motion"
top: "res3b3_branch2a_motion"
param {
  name: "bn3b3_branch2a_0_motion"
  lr_mult: 0.0
}
param {
  name: "bn3b3_branch2a_1_motion"
  lr_mult: 0.0
}
param {
  name: "bn3b3_branch2a_2_motion"
  lr_mult: 0.0
}
batch_norm_param {
  use_global_stats: true
}
}

layer {
name: "scale3b3_branch2a_motion"
type: "Scale"
bottom: "res3b3_branch2a_motion"
top: "res3b3_branch2a_motion"
param {
  name: "scale3b3_branch2a_0_motion"
  lr_mult: 0.0
}
param {
  name: "scale3b3_branch2a_1_motion"
  lr_mult: 0.0
}
scale_param {
  bias_term: true
}
}

layer {
name: "res3b3_branch2a_relu_motion"
type: "ReLU"
bottom: "res3b3_branch2a_motion"
top: "res3b3_branch2a_motion"
}

layer {
name: "res3b3_branch2b_motion"
type: "Convolution"
bottom: "res3b3_branch2a_motion"
top: "res3b3_branch2b_motion"
param {
  name: "res3b3_branch2b_0_motion"
  lr_mult: 1.0
  decay_mult: 1.0
}
convolution_param {
  num_output: 128
  bias_term: false
  pad: 1
  kernel_size: 3
  stride: 1
}
}

layer {
name: "bn3b3_branch2b_motion"
type: "BatchNorm"
bottom: "res3b3_branch2b_motion"
top: "res3b3_branch2b_motion"
param {
  name: "bn3b3_branch2b_0_motion"
  lr_mult: 0.0
}
param {
  name: "bn3b3_branch2b_1_motion"
  lr_mult: 0.0
}
param {
  name: "bn3b3_branch2b_2_motion"
  lr_mult: 0.0
}
batch_norm_param {
  use_global_stats: true
}
}

layer {
name: "scale3b3_branch2b_motion"
type: "Scale"
bottom: "res3b3_branch2b_motion"
top: "res3b3_branch2b_motion"
param {
  name: "scale3b3_branch2b_0_motion"
  lr_mult: 0.0
}
param {
  name: "scale3b3_branch2b_1_motion"
  lr_mult: 0.0
}
scale_param {
  bias_term: true
}
}

layer {
name: "res3b3_branch2b_relu_motion"
type: "ReLU"
bottom: "res3b3_branch2b_motion"
top: "res3b3_branch2b_motion"
}

layer {
name: "res3b3_branch2c_motion"
type: "Convolution"
bottom: "res3b3_branch2b_motion"
top: "res3b3_branch2c_motion"
param {
  name: "res3b3_branch2c_0_motion"
  lr_mult: 1.0
  decay_mult: 1.0
}
convolution_param {
  num_output: 512
  bias_term: false
  pad: 0
  kernel_size: 1
  stride: 1
}
}

layer {
name: "bn3b3_branch2c_motion"
type: "BatchNorm"
bottom: "res3b3_branch2c_motion"
top: "res3b3_branch2c_motion"
param {
  name: "bn3b3_branch2c_0_motion"
  lr_mult: 0.0
}
param {
  name: "bn3b3_branch2c_1_motion"
  lr_mult: 0.0
}
param {
  name: "bn3b3_branch2c_2_motion"
  lr_mult: 0.0
}
batch_norm_param {
  use_global_stats: true
}
}

layer {
name: "scale3b3_branch2c_motion"
type: "Scale"
bottom: "res3b3_branch2c_motion"
top: "res3b3_branch2c_motion"
param {
  name: "scale3b3_branch2c_0_motion"
  lr_mult: 0.0
}
param {
  name: "scale3b3_branch2c_1_motion"
  lr_mult: 0.0
}
scale_param {
  bias_term: true
}
}

layer {
name: "res3b3_motion"
type: "Eltwise"
bottom: "res3b2_motion"
bottom: "res3b3_branch2c_motion"
top: "res3b3_motion"
}

layer {
name: "res3b3_relu_motion"
type: "ReLU"
bottom: "res3b3_motion"
top: "res3b3_motion"
}

layer {
name: "res4a_branch1_motion"
type: "Convolution"
bottom: "res3b3_motion"
top: "res4a_branch1_motion"
param {
  name: "res4a_branch1_0_motion"
  lr_mult: 1.0
  decay_mult: 1.0
}
convolution_param {
  num_output: 1024
  bias_term: false
  pad: 0
  kernel_size: 1
  stride: 1
}
}

layer {
name: "bn4a_branch1_motion"
type: "BatchNorm"
bottom: "res4a_branch1_motion"
top: "res4a_branch1_motion"
param {
  name: "bn4a_branch1_0_motion"
  lr_mult: 0.0
}
param {
  name: "bn4a_branch1_1_motion"
  lr_mult: 0.0
}
param {
  name: "bn4a_branch1_2_motion"
  lr_mult: 0.0
}
batch_norm_param {
  use_global_stats: true
}
}

layer {
name: "scale4a_branch1_motion"
type: "Scale"
bottom: "res4a_branch1_motion"
top: "res4a_branch1_motion"
param {
  name: "scale4a_branch1_0_motion"
  lr_mult: 0.0
}
param {
  name: "scale4a_branch1_1_motion"
  lr_mult: 0.0
}
scale_param {
  bias_term: true
}
}

layer {
name: "res4a_branch2a_motion"
type: "Convolution"
bottom: "res3b3_motion"
top: "res4a_branch2a_motion"
param {
  name: "res4a_branch2a_0_motion"
  lr_mult: 1.0
  decay_mult: 1.0
}
convolution_param {
  num_output: 256
  bias_term: false
  pad: 0
  kernel_size: 1
  stride: 1
}
}

layer {
name: "bn4a_branch2a_motion"
type: "BatchNorm"
bottom: "res4a_branch2a_motion"
top: "res4a_branch2a_motion"
param {
  name: "bn4a_branch2a_0_motion"
  lr_mult: 0.0
}
param {
  name: "bn4a_branch2a_1_motion"
  lr_mult: 0.0
}
param {
  name: "bn4a_branch2a_2_motion"
  lr_mult: 0.0
}
batch_norm_param {
  use_global_stats: true
}
}

layer {
name: "scale4a_branch2a_motion"
type: "Scale"
bottom: "res4a_branch2a_motion"
top: "res4a_branch2a_motion"
param {
  name: "scale4a_branch2a_0_motion"
  lr_mult: 0.0
}
param {
  name: "scale4a_branch2a_1_motion"
  lr_mult: 0.0
}
scale_param {
  bias_term: true
}
}

layer {
name: "res4a_branch2a_relu_motion"
type: "ReLU"
bottom: "res4a_branch2a_motion"
top: "res4a_branch2a_motion"
}

layer {
name: "res4a_branch2b_motion"
type: "Convolution"
bottom: "res4a_branch2a_motion"
top: "res4a_branch2b_motion"
param {
  name: "res4a_branch2b_0_motion"
  lr_mult: 1.0
  decay_mult: 1.0
}
convolution_param {
  num_output: 256
  bias_term: false
  pad: 2
  kernel_size: 3
  stride: 1
  dilation: 2
}
}

layer {
name: "bn4a_branch2b_motion"
type: "BatchNorm"
bottom: "res4a_branch2b_motion"
top: "res4a_branch2b_motion"
param {
  name: "bn4a_branch2b_0_motion"
  lr_mult: 0.0
}
param {
  name: "bn4a_branch2b_1_motion"
  lr_mult: 0.0
}
param {
  name: "bn4a_branch2b_2_motion"
  lr_mult: 0.0
}
batch_norm_param {
  use_global_stats: true
}
}

layer {
name: "scale4a_branch2b_motion"
type: "Scale"
bottom: "res4a_branch2b_motion"
top: "res4a_branch2b_motion"
param {
  name: "scale4a_branch2b_0_motion"
  lr_mult: 0.0
}
param {
  name: "scale4a_branch2b_1_motion"
  lr_mult: 0.0
}
scale_param {
  bias_term: true
}
}

layer {
name: "res4a_branch2b_relu_motion"
type: "ReLU"
bottom: "res4a_branch2b_motion"
top: "res4a_branch2b_motion"
}

layer {
name: "res4a_branch2c_motion"
type: "Convolution"
bottom: "res4a_branch2b_motion"
top: "res4a_branch2c_motion"
param {
  name: "res4a_branch2c_0_motion"
  lr_mult: 1.0
  decay_mult: 1.0
}
convolution_param {
  num_output: 1024
  bias_term: false
  pad: 0
  kernel_size: 1
  stride: 1
}
}

layer {
name: "bn4a_branch2c_motion"
type: "BatchNorm"
bottom: "res4a_branch2c_motion"
top: "res4a_branch2c_motion"
param {
  name: "bn4a_branch2c_0_motion"
  lr_mult: 0.0
}
param {
  name: "bn4a_branch2c_1_motion"
  lr_mult: 0.0
}
param {
  name: "bn4a_branch2c_2_motion"
  lr_mult: 0.0
}
batch_norm_param {
  use_global_stats: true
}
}

layer {
name: "scale4a_branch2c_motion"
type: "Scale"
bottom: "res4a_branch2c_motion"
top: "res4a_branch2c_motion"
param {
  name: "scale4a_branch2c_0_motion"
  lr_mult: 0.0
}
param {
  name: "scale4a_branch2c_1_motion"
  lr_mult: 0.0
}
scale_param {
  bias_term: true
}
}

layer {
name: "res4a_motion"
type: "Eltwise"
bottom: "res4a_branch1_motion"
bottom: "res4a_branch2c_motion"
top: "res4a_motion"
}

layer {
name: "res4a_relu_motion"
type: "ReLU"
bottom: "res4a_motion"
top: "res4a_motion"
}

layer {
name: "res4b1_branch2a_motion"
type: "Convolution"
bottom: "res4a_motion"
top: "res4b1_branch2a_motion"
param {
  name: "res4b1_branch2a_0_motion"
  lr_mult: 1.0
  decay_mult: 1.0
}
convolution_param {
  num_output: 256
  bias_term: false
  pad: 0
  kernel_size: 1
  stride: 1
}
}

layer {
name: "bn4b1_branch2a_motion"
type: "BatchNorm"
bottom: "res4b1_branch2a_motion"
top: "res4b1_branch2a_motion"
param {
  name: "bn4b1_branch2a_0_motion"
  lr_mult: 0.0
}
param {
  name: "bn4b1_branch2a_1_motion"
  lr_mult: 0.0
}
param {
  name: "bn4b1_branch2a_2_motion"
  lr_mult: 0.0
}
batch_norm_param {
  use_global_stats: true
}
}

layer {
name: "scale4b1_branch2a_motion"
type: "Scale"
bottom: "res4b1_branch2a_motion"
top: "res4b1_branch2a_motion"
param {
  name: "scale4b1_branch2a_0_motion"
  lr_mult: 0.0
}
param {
  name: "scale4b1_branch2a_1_motion"
  lr_mult: 0.0
}
scale_param {
  bias_term: true
}
}

layer {
name: "res4b1_branch2a_relu_motion"
type: "ReLU"
bottom: "res4b1_branch2a_motion"
top: "res4b1_branch2a_motion"
}

layer {
name: "res4b1_branch2b_motion"
type: "Convolution"
bottom: "res4b1_branch2a_motion"
top: "res4b1_branch2b_motion"
param {
  name: "res4b1_branch2b_0_motion"
  lr_mult: 1.0
  decay_mult: 1.0
}
convolution_param {
  num_output: 256
  bias_term: false
  pad: 2
  kernel_size: 3
  stride: 1
  dilation: 2
}
}

layer {
name: "bn4b1_branch2b_motion"
type: "BatchNorm"
bottom: "res4b1_branch2b_motion"
top: "res4b1_branch2b_motion"
param {
  name: "bn4b1_branch2b_0_motion"
  lr_mult: 0.0
}
param {
  name: "bn4b1_branch2b_1_motion"
  lr_mult: 0.0
}
param {
  name: "bn4b1_branch2b_2_motion"
  lr_mult: 0.0
}
batch_norm_param {
  use_global_stats: true
}
}

layer {
name: "scale4b1_branch2b_motion"
type: "Scale"
bottom: "res4b1_branch2b_motion"
top: "res4b1_branch2b_motion"
param {
  name: "scale4b1_branch2b_0_motion"
  lr_mult: 0.0
}
param {
  name: "scale4b1_branch2b_1_motion"
  lr_mult: 0.0
}
scale_param {
  bias_term: true
}
}

layer {
name: "res4b1_branch2b_relu_motion"
type: "ReLU"
bottom: "res4b1_branch2b_motion"
top: "res4b1_branch2b_motion"
}

layer {
name: "res4b1_branch2c_motion"
type: "Convolution"
bottom: "res4b1_branch2b_motion"
top: "res4b1_branch2c_motion"
param {
  name: "res4b1_branch2c_0_motion"
  lr_mult: 1.0
  decay_mult: 1.0
}
convolution_param {
  num_output: 1024
  bias_term: false
  pad: 0
  kernel_size: 1
  stride: 1
}
}

layer {
name: "bn4b1_branch2c_motion"
type: "BatchNorm"
bottom: "res4b1_branch2c_motion"
top: "res4b1_branch2c_motion"
param {
  name: "bn4b1_branch2c_0_motion"
  lr_mult: 0.0
}
param {
  name: "bn4b1_branch2c_1_motion"
  lr_mult: 0.0
}
param {
  name: "bn4b1_branch2c_2_motion"
  lr_mult: 0.0
}
batch_norm_param {
  use_global_stats: true
}
}

layer {
name: "scale4b1_branch2c_motion"
type: "Scale"
bottom: "res4b1_branch2c_motion"
top: "res4b1_branch2c_motion"
param {
  name: "scale4b1_branch2c_0_motion"
  lr_mult: 0.0
}
param {
  name: "scale4b1_branch2c_1_motion"
  lr_mult: 0.0
}
scale_param {
  bias_term: true
}
}

layer {
name: "res4b1_motion"
type: "Eltwise"
bottom: "res4a_motion"
bottom: "res4b1_branch2c_motion"
top: "res4b1_motion"
}

layer {
name: "res4b1_relu_motion"
type: "ReLU"
bottom: "res4b1_motion"
top: "res4b1_motion"
}

layer {
name: "res4b2_branch2a_motion"
type: "Convolution"
bottom: "res4b1_motion"
top: "res4b2_branch2a_motion"
param {
  name: "res4b2_branch2a_0_motion"
  lr_mult: 1.0
  decay_mult: 1.0
}
convolution_param {
  num_output: 256
  bias_term: false
  pad: 0
  kernel_size: 1
  stride: 1
}
}

layer {
name: "bn4b2_branch2a_motion"
type: "BatchNorm"
bottom: "res4b2_branch2a_motion"
top: "res4b2_branch2a_motion"
param {
  name: "bn4b2_branch2a_0_motion"
  lr_mult: 0.0
}
param {
  name: "bn4b2_branch2a_1_motion"
  lr_mult: 0.0
}
param {
  name: "bn4b2_branch2a_2_motion"
  lr_mult: 0.0
}
batch_norm_param {
  use_global_stats: true
}
}

layer {
name: "scale4b2_branch2a_motion"
type: "Scale"
bottom: "res4b2_branch2a_motion"
top: "res4b2_branch2a_motion"
param {
  name: "scale4b2_branch2a_0_motion"
  lr_mult: 0.0
}
param {
  name: "scale4b2_branch2a_1_motion"
  lr_mult: 0.0
}
scale_param {
  bias_term: true
}
}

layer {
name: "res4b2_branch2a_relu_motion"
type: "ReLU"
bottom: "res4b2_branch2a_motion"
top: "res4b2_branch2a_motion"
}

layer {
name: "res4b2_branch2b_motion"
type: "Convolution"
bottom: "res4b2_branch2a_motion"
top: "res4b2_branch2b_motion"
param {
  name: "res4b2_branch2b_0_motion"
  lr_mult: 1.0
  decay_mult: 1.0
}
convolution_param {
  num_output: 256
  bias_term: false
  pad: 2
  kernel_size: 3
  stride: 1
  dilation: 2
}
}

layer {
name: "bn4b2_branch2b_motion"
type: "BatchNorm"
bottom: "res4b2_branch2b_motion"
top: "res4b2_branch2b_motion"
param {
  name: "bn4b2_branch2b_0_motion"
  lr_mult: 0.0
}
param {
  name: "bn4b2_branch2b_1_motion"
  lr_mult: 0.0
}
param {
  name: "bn4b2_branch2b_2_motion"
  lr_mult: 0.0
}
batch_norm_param {
  use_global_stats: true
}
}

layer {
name: "scale4b2_branch2b_motion"
type: "Scale"
bottom: "res4b2_branch2b_motion"
top: "res4b2_branch2b_motion"
param {
  name: "scale4b2_branch2b_0_motion"
  lr_mult: 0.0
}
param {
  name: "scale4b2_branch2b_1_motion"
  lr_mult: 0.0
}
scale_param {
  bias_term: true
}
}

layer {
name: "res4b2_branch2b_relu_motion"
type: "ReLU"
bottom: "res4b2_branch2b_motion"
top: "res4b2_branch2b_motion"
}

layer {
name: "res4b2_branch2c_motion"
type: "Convolution"
bottom: "res4b2_branch2b_motion"
top: "res4b2_branch2c_motion"
param {
  name: "res4b2_branch2c_0_motion"
  lr_mult: 1.0
  decay_mult: 1.0
}
convolution_param {
  num_output: 1024
  bias_term: false
  pad: 0
  kernel_size: 1
  stride: 1
}
}

layer {
name: "bn4b2_branch2c_motion"
type: "BatchNorm"
bottom: "res4b2_branch2c_motion"
top: "res4b2_branch2c_motion"
param {
  name: "bn4b2_branch2c_0_motion"
  lr_mult: 0.0
}
param {
  name: "bn4b2_branch2c_1_motion"
  lr_mult: 0.0
}
param {
  name: "bn4b2_branch2c_2_motion"
  lr_mult: 0.0
}
batch_norm_param {
  use_global_stats: true
}
}

layer {
name: "scale4b2_branch2c_motion"
type: "Scale"
bottom: "res4b2_branch2c_motion"
top: "res4b2_branch2c_motion"
param {
  name: "scale4b2_branch2c_0_motion"
  lr_mult: 0.0
}
param {
  name: "scale4b2_branch2c_1_motion"
  lr_mult: 0.0
}
scale_param {
  bias_term: true
}
}

layer {
name: "res4b2_motion"
type: "Eltwise"
bottom: "res4b1_motion"
bottom: "res4b2_branch2c_motion"
top: "res4b2_motion"
}

layer {
name: "res4b2_relu_motion"
type: "ReLU"
bottom: "res4b2_motion"
top: "res4b2_motion"
}

layer {
name: "res4b3_branch2a_motion"
type: "Convolution"
bottom: "res4b2_motion"
top: "res4b3_branch2a_motion"
param {
  name: "res4b3_branch2a_0_motion"
  lr_mult: 1.0
  decay_mult: 1.0
}
convolution_param {
  num_output: 256
  bias_term: false
  pad: 0
  kernel_size: 1
  stride: 1
}
}

layer {
name: "bn4b3_branch2a_motion"
type: "BatchNorm"
bottom: "res4b3_branch2a_motion"
top: "res4b3_branch2a_motion"
param {
  name: "bn4b3_branch2a_0_motion"
  lr_mult: 0.0
}
param {
  name: "bn4b3_branch2a_1_motion"
  lr_mult: 0.0
}
param {
  name: "bn4b3_branch2a_2_motion"
  lr_mult: 0.0
}
batch_norm_param {
  use_global_stats: true
}
}

layer {
name: "scale4b3_branch2a_motion"
type: "Scale"
bottom: "res4b3_branch2a_motion"
top: "res4b3_branch2a_motion"
param {
  name: "scale4b3_branch2a_0_motion"
  lr_mult: 0.0
}
param {
  name: "scale4b3_branch2a_1_motion"
  lr_mult: 0.0
}
scale_param {
  bias_term: true
}
}

layer {
name: "res4b3_branch2a_relu_motion"
type: "ReLU"
bottom: "res4b3_branch2a_motion"
top: "res4b3_branch2a_motion"
}

layer {
name: "res4b3_branch2b_motion"
type: "Convolution"
bottom: "res4b3_branch2a_motion"
top: "res4b3_branch2b_motion"
param {
  name: "res4b3_branch2b_0_motion"
  lr_mult: 1.0
  decay_mult: 1.0
}
convolution_param {
  num_output: 256
  bias_term: false
  pad: 2
  kernel_size: 3
  stride: 1
  dilation: 2
}
}

layer {
name: "bn4b3_branch2b_motion"
type: "BatchNorm"
bottom: "res4b3_branch2b_motion"
top: "res4b3_branch2b_motion"
param {
  name: "bn4b3_branch2b_0_motion"
  lr_mult: 0.0
}
param {
  name: "bn4b3_branch2b_1_motion"
  lr_mult: 0.0
}
param {
  name: "bn4b3_branch2b_2_motion"
  lr_mult: 0.0
}
batch_norm_param {
  use_global_stats: true
}
}

layer {
name: "scale4b3_branch2b_motion"
type: "Scale"
bottom: "res4b3_branch2b_motion"
top: "res4b3_branch2b_motion"
param {
  name: "scale4b3_branch2b_0_motion"
  lr_mult: 0.0
}
param {
  name: "scale4b3_branch2b_1_motion"
  lr_mult: 0.0
}
scale_param {
  bias_term: true
}
}

layer {
name: "res4b3_branch2b_relu_motion"
type: "ReLU"
bottom: "res4b3_branch2b_motion"
top: "res4b3_branch2b_motion"
}

layer {
name: "res4b3_branch2c_motion"
type: "Convolution"
bottom: "res4b3_branch2b_motion"
top: "res4b3_branch2c_motion"
param {
  name: "res4b3_branch2c_0_motion"
  lr_mult: 1.0
  decay_mult: 1.0
}
convolution_param {
  num_output: 1024
  bias_term: false
  pad: 0
  kernel_size: 1
  stride: 1
}
}

layer {
name: "bn4b3_branch2c_motion"
type: "BatchNorm"
bottom: "res4b3_branch2c_motion"
top: "res4b3_branch2c_motion"
param {
  name: "bn4b3_branch2c_0_motion"
  lr_mult: 0.0
}
param {
  name: "bn4b3_branch2c_1_motion"
  lr_mult: 0.0
}
param {
  name: "bn4b3_branch2c_2_motion"
  lr_mult: 0.0
}
batch_norm_param {
  use_global_stats: true
}
}

layer {
name: "scale4b3_branch2c_motion"
type: "Scale"
bottom: "res4b3_branch2c_motion"
top: "res4b3_branch2c_motion"
param {
  name: "scale4b3_branch2c_0_motion"
  lr_mult: 0.0
}
param {
  name: "scale4b3_branch2c_1_motion"
  lr_mult: 0.0
}
scale_param {
  bias_term: true
}
}

layer {
name: "res4b3_motion"
type: "Eltwise"
bottom: "res4b2_motion"
bottom: "res4b3_branch2c_motion"
top: "res4b3_motion"
}

layer {
name: "res4b3_relu_motion"
type: "ReLU"
bottom: "res4b3_motion"
top: "res4b3_motion"
}

layer {
name: "res4b4_branch2a_motion"
type: "Convolution"
bottom: "res4b3_motion"
top: "res4b4_branch2a_motion"
param {
  name: "res4b4_branch2a_0_motion"
  lr_mult: 1.0
  decay_mult: 1.0
}
convolution_param {
  num_output: 256
  bias_term: false
  pad: 0
  kernel_size: 1
  stride: 1
}
}

layer {
name: "bn4b4_branch2a_motion"
type: "BatchNorm"
bottom: "res4b4_branch2a_motion"
top: "res4b4_branch2a_motion"
param {
  name: "bn4b4_branch2a_0_motion"
  lr_mult: 0.0
}
param {
  name: "bn4b4_branch2a_1_motion"
  lr_mult: 0.0
}
param {
  name: "bn4b4_branch2a_2_motion"
  lr_mult: 0.0
}
batch_norm_param {
  use_global_stats: true
}
}

layer {
name: "scale4b4_branch2a_motion"
type: "Scale"
bottom: "res4b4_branch2a_motion"
top: "res4b4_branch2a_motion"
param {
  name: "scale4b4_branch2a_0_motion"
  lr_mult: 0.0
}
param {
  name: "scale4b4_branch2a_1_motion"
  lr_mult: 0.0
}
scale_param {
  bias_term: true
}
}

layer {
name: "res4b4_branch2a_relu_motion"
type: "ReLU"
bottom: "res4b4_branch2a_motion"
top: "res4b4_branch2a_motion"
}

layer {
name: "res4b4_branch2b_motion"
type: "Convolution"
bottom: "res4b4_branch2a_motion"
top: "res4b4_branch2b_motion"
param {
  name: "res4b4_branch2b_0_motion"
  lr_mult: 1.0
  decay_mult: 1.0
}
convolution_param {
  num_output: 256
  bias_term: false
  pad: 2
  kernel_size: 3
  stride: 1
  dilation: 2
}
}

layer {
name: "bn4b4_branch2b_motion"
type: "BatchNorm"
bottom: "res4b4_branch2b_motion"
top: "res4b4_branch2b_motion"
param {
  name: "bn4b4_branch2b_0_motion"
  lr_mult: 0.0
}
param {
  name: "bn4b4_branch2b_1_motion"
  lr_mult: 0.0
}
param {
  name: "bn4b4_branch2b_2_motion"
  lr_mult: 0.0
}
batch_norm_param {
  use_global_stats: true
}
}

layer {
name: "scale4b4_branch2b_motion"
type: "Scale"
bottom: "res4b4_branch2b_motion"
top: "res4b4_branch2b_motion"
param {
  name: "scale4b4_branch2b_0_motion"
  lr_mult: 0.0
}
param {
  name: "scale4b4_branch2b_1_motion"
  lr_mult: 0.0
}
scale_param {
  bias_term: true
}
}

layer {
name: "res4b4_branch2b_relu_motion"
type: "ReLU"
bottom: "res4b4_branch2b_motion"
top: "res4b4_branch2b_motion"
}

layer {
name: "res4b4_branch2c_motion"
type: "Convolution"
bottom: "res4b4_branch2b_motion"
top: "res4b4_branch2c_motion"
param {
  name: "res4b4_branch2c_0_motion"
  lr_mult: 1.0
  decay_mult: 1.0
}
convolution_param {
  num_output: 1024
  bias_term: false
  pad: 0
  kernel_size: 1
  stride: 1
}
}

layer {
name: "bn4b4_branch2c_motion"
type: "BatchNorm"
bottom: "res4b4_branch2c_motion"
top: "res4b4_branch2c_motion"
param {
  name: "bn4b4_branch2c_0_motion"
  lr_mult: 0.0
}
param {
  name: "bn4b4_branch2c_1_motion"
  lr_mult: 0.0
}
param {
  name: "bn4b4_branch2c_2_motion"
  lr_mult: 0.0
}
batch_norm_param {
  use_global_stats: true
}
}

layer {
name: "scale4b4_branch2c_motion"
type: "Scale"
bottom: "res4b4_branch2c_motion"
top: "res4b4_branch2c_motion"
param {
  name: "scale4b4_branch2c_0_motion"
  lr_mult: 0.0
}
param {
  name: "scale4b4_branch2c_1_motion"
  lr_mult: 0.0
}
scale_param {
  bias_term: true
}
}

layer {
name: "res4b4_motion"
type: "Eltwise"
bottom: "res4b3_motion"
bottom: "res4b4_branch2c_motion"
top: "res4b4_motion"
}

layer {
name: "res4b4_relu_motion"
type: "ReLU"
bottom: "res4b4_motion"
top: "res4b4_motion"
}

layer {
name: "res4b5_branch2a_motion"
type: "Convolution"
bottom: "res4b4_motion"
top: "res4b5_branch2a_motion"
param {
  name: "res4b5_branch2a_0_motion"
  lr_mult: 1.0
  decay_mult: 1.0
}
convolution_param {
  num_output: 256
  bias_term: false
  pad: 0
  kernel_size: 1
  stride: 1
}
}

layer {
name: "bn4b5_branch2a_motion"
type: "BatchNorm"
bottom: "res4b5_branch2a_motion"
top: "res4b5_branch2a_motion"
param {
  name: "bn4b5_branch2a_0_motion"
  lr_mult: 0.0
}
param {
  name: "bn4b5_branch2a_1_motion"
  lr_mult: 0.0
}
param {
  name: "bn4b5_branch2a_2_motion"
  lr_mult: 0.0
}
batch_norm_param {
  use_global_stats: true
}
}

layer {
name: "scale4b5_branch2a_motion"
type: "Scale"
bottom: "res4b5_branch2a_motion"
top: "res4b5_branch2a_motion"
param {
  name: "scale4b5_branch2a_0_motion"
  lr_mult: 0.0
}
param {
  name: "scale4b5_branch2a_1_motion"
  lr_mult: 0.0
}
scale_param {
  bias_term: true
}
}

layer {
name: "res4b5_branch2a_relu_motion"
type: "ReLU"
bottom: "res4b5_branch2a_motion"
top: "res4b5_branch2a_motion"
}

layer {
name: "res4b5_branch2b_motion"
type: "Convolution"
bottom: "res4b5_branch2a_motion"
top: "res4b5_branch2b_motion"
param {
  name: "res4b5_branch2b_0_motion"
  lr_mult: 1.0
  decay_mult: 1.0
}
convolution_param {
  num_output: 256
  bias_term: false
  pad: 2
  kernel_size: 3
  stride: 1
  dilation: 2
}
}

layer {
name: "bn4b5_branch2b_motion"
type: "BatchNorm"
bottom: "res4b5_branch2b_motion"
top: "res4b5_branch2b_motion"
param {
  name: "bn4b5_branch2b_0_motion"
  lr_mult: 0.0
}
param {
  name: "bn4b5_branch2b_1_motion"
  lr_mult: 0.0
}
param {
  name: "bn4b5_branch2b_2_motion"
  lr_mult: 0.0
}
batch_norm_param {
  use_global_stats: true
}
}

layer {
name: "scale4b5_branch2b_motion"
type: "Scale"
bottom: "res4b5_branch2b_motion"
top: "res4b5_branch2b_motion"
param {
  name: "scale4b5_branch2b_0_motion"
  lr_mult: 0.0
}
param {
  name: "scale4b5_branch2b_1_motion"
  lr_mult: 0.0
}
scale_param {
  bias_term: true
}
}

layer {
name: "res4b5_branch2b_relu_motion"
type: "ReLU"
bottom: "res4b5_branch2b_motion"
top: "res4b5_branch2b_motion"
}

layer {
name: "res4b5_branch2c_motion"
type: "Convolution"
bottom: "res4b5_branch2b_motion"
top: "res4b5_branch2c_motion"
param {
  name: "res4b5_branch2c_0_motion"
  lr_mult: 1.0
  decay_mult: 1.0
}
convolution_param {
  num_output: 1024
  bias_term: false
  pad: 0
  kernel_size: 1
  stride: 1
}
}

layer {
name: "bn4b5_branch2c_motion"
type: "BatchNorm"
bottom: "res4b5_branch2c_motion"
top: "res4b5_branch2c_motion"
param {
  name: "bn4b5_branch2c_0_motion"
  lr_mult: 0.0
}
param {
  name: "bn4b5_branch2c_1_motion"
  lr_mult: 0.0
}
param {
  name: "bn4b5_branch2c_2_motion"
  lr_mult: 0.0
}
batch_norm_param {
  use_global_stats: true
}
}

layer {
name: "scale4b5_branch2c_motion"
type: "Scale"
bottom: "res4b5_branch2c_motion"
top: "res4b5_branch2c_motion"
param {
  name: "scale4b5_branch2c_0_motion"
  lr_mult: 0.0
}
param {
  name: "scale4b5_branch2c_1_motion"
  lr_mult: 0.0
}
scale_param {
  bias_term: true
}
}

layer {
name: "res4b5_motion"
type: "Eltwise"
bottom: "res4b4_motion"
bottom: "res4b5_branch2c_motion"
top: "res4b5_motion"
}

layer {
name: "res4b5_relu_motion"
type: "ReLU"
bottom: "res4b5_motion"
top: "res4b5_motion"
}

layer {
name: "res4b6_branch2a_motion"
type: "Convolution"
bottom: "res4b5_motion"
top: "res4b6_branch2a_motion"
param {
  name: "res4b6_branch2a_0_motion"
  lr_mult: 1.0
  decay_mult: 1.0
}
convolution_param {
  num_output: 256
  bias_term: false
  pad: 0
  kernel_size: 1
  stride: 1
}
}

layer {
name: "bn4b6_branch2a_motion"
type: "BatchNorm"
bottom: "res4b6_branch2a_motion"
top: "res4b6_branch2a_motion"
param {
  name: "bn4b6_branch2a_0_motion"
  lr_mult: 0.0
}
param {
  name: "bn4b6_branch2a_1_motion"
  lr_mult: 0.0
}
param {
  name: "bn4b6_branch2a_2_motion"
  lr_mult: 0.0
}
batch_norm_param {
  use_global_stats: true
}
}

layer {
name: "scale4b6_branch2a_motion"
type: "Scale"
bottom: "res4b6_branch2a_motion"
top: "res4b6_branch2a_motion"
param {
  name: "scale4b6_branch2a_0_motion"
  lr_mult: 0.0
}
param {
  name: "scale4b6_branch2a_1_motion"
  lr_mult: 0.0
}
scale_param {
  bias_term: true
}
}

layer {
name: "res4b6_branch2a_relu_motion"
type: "ReLU"
bottom: "res4b6_branch2a_motion"
top: "res4b6_branch2a_motion"
}

layer {
name: "res4b6_branch2b_motion"
type: "Convolution"
bottom: "res4b6_branch2a_motion"
top: "res4b6_branch2b_motion"
param {
  name: "res4b6_branch2b_0_motion"
  lr_mult: 1.0
  decay_mult: 1.0
}
convolution_param {
  num_output: 256
  bias_term: false
  pad: 2
  kernel_size: 3
  stride: 1
  dilation: 2
}
}

layer {
name: "bn4b6_branch2b_motion"
type: "BatchNorm"
bottom: "res4b6_branch2b_motion"
top: "res4b6_branch2b_motion"
param {
  name: "bn4b6_branch2b_0_motion"
  lr_mult: 0.0
}
param {
  name: "bn4b6_branch2b_1_motion"
  lr_mult: 0.0
}
param {
  name: "bn4b6_branch2b_2_motion"
  lr_mult: 0.0
}
batch_norm_param {
  use_global_stats: true
}
}

layer {
name: "scale4b6_branch2b_motion"
type: "Scale"
bottom: "res4b6_branch2b_motion"
top: "res4b6_branch2b_motion"
param {
  name: "scale4b6_branch2b_0_motion"
  lr_mult: 0.0
}
param {
  name: "scale4b6_branch2b_1_motion"
  lr_mult: 0.0
}
scale_param {
  bias_term: true
}
}

layer {
name: "res4b6_branch2b_relu_motion"
type: "ReLU"
bottom: "res4b6_branch2b_motion"
top: "res4b6_branch2b_motion"
}

layer {
name: "res4b6_branch2c_motion"
type: "Convolution"
bottom: "res4b6_branch2b_motion"
top: "res4b6_branch2c_motion"
param {
  name: "res4b6_branch2c_0_motion"
  lr_mult: 1.0
  decay_mult: 1.0
}
convolution_param {
  num_output: 1024
  bias_term: false
  pad: 0
  kernel_size: 1
  stride: 1
}
}

layer {
name: "bn4b6_branch2c_motion"
type: "BatchNorm"
bottom: "res4b6_branch2c_motion"
top: "res4b6_branch2c_motion"
param {
  name: "bn4b6_branch2c_0_motion"
  lr_mult: 0.0
}
param {
  name: "bn4b6_branch2c_1_motion"
  lr_mult: 0.0
}
param {
  name: "bn4b6_branch2c_2_motion"
  lr_mult: 0.0
}
batch_norm_param {
  use_global_stats: true
}
}

layer {
name: "scale4b6_branch2c_motion"
type: "Scale"
bottom: "res4b6_branch2c_motion"
top: "res4b6_branch2c_motion"
param {
  name: "scale4b6_branch2c_0_motion"
  lr_mult: 0.0
}
param {
  name: "scale4b6_branch2c_1_motion"
  lr_mult: 0.0
}
scale_param {
  bias_term: true
}
}

layer {
name: "res4b6_motion"
type: "Eltwise"
bottom: "res4b5_motion"
bottom: "res4b6_branch2c_motion"
top: "res4b6_motion"
}

layer {
name: "res4b6_relu_motion"
type: "ReLU"
bottom: "res4b6_motion"
top: "res4b6_motion"
}

layer {
name: "res4b7_branch2a_motion"
type: "Convolution"
bottom: "res4b6_motion"
top: "res4b7_branch2a_motion"
param {
  name: "res4b7_branch2a_0_motion"
  lr_mult: 1.0
  decay_mult: 1.0
}
convolution_param {
  num_output: 256
  bias_term: false
  pad: 0
  kernel_size: 1
  stride: 1
}
}

layer {
name: "bn4b7_branch2a_motion"
type: "BatchNorm"
bottom: "res4b7_branch2a_motion"
top: "res4b7_branch2a_motion"
param {
  name: "bn4b7_branch2a_0_motion"
  lr_mult: 0.0
}
param {
  name: "bn4b7_branch2a_1_motion"
  lr_mult: 0.0
}
param {
  name: "bn4b7_branch2a_2_motion"
  lr_mult: 0.0
}
batch_norm_param {
  use_global_stats: true
}
}

layer {
name: "scale4b7_branch2a_motion"
type: "Scale"
bottom: "res4b7_branch2a_motion"
top: "res4b7_branch2a_motion"
param {
  name: "scale4b7_branch2a_0_motion"
  lr_mult: 0.0
}
param {
  name: "scale4b7_branch2a_1_motion"
  lr_mult: 0.0
}
scale_param {
  bias_term: true
}
}

layer {
name: "res4b7_branch2a_relu_motion"
type: "ReLU"
bottom: "res4b7_branch2a_motion"
top: "res4b7_branch2a_motion"
}

layer {
name: "res4b7_branch2b_motion"
type: "Convolution"
